import React, { useEffect,useState } from 'react'
import "./style.scss"

const SearchPage = ( {data}) => {
  // const data = {
  //   "searchList": [
  //     "최호준[부울경_1반_E101] 팀원",
  //     "최광호[서울_3반_A301]팀원",
  //     "최소희[부울경_기업연계_S107] 팀원",
  //     "최영진[부울경_1반_E103]팀원",
  //     "최유미[대전_2반_B203]팀원",
  //     "최윤희[부울경_2반]",
  //     "최나현[서울_4반]실습코치",
  //     "최정민[서울_2반_A204]팀원",
  //     "최시열[대전_1반_B105]팀원",
  //     "최명재[부울경_2반_E204] 팀장",
  //     "최재훈[서울_2반_A203]팀원",
  //     "최수한[광주_1반_C102]팀원",
  //     "최대호[구미_1반_D102]팀원",
  //     "최성석[구미_2반_D205]팀원",
  //     "최광호(담당교수)",
  //     "대전_3반_최호연",
  //     "최다연[서울_5반_A502]팀원",
  //     "최일권[서울_2반_A203]팀원",
  //     "서울_B-6_최연두",
  //     "광주_3반_최현준",
  //     "최현석[구미_2반_D202]팀원",
  //     "최인국(담당교수)",
  //     "최형오[구미_2반_D207]팀원",
  //     "최강현[광주_1반_C104]팀원",
  //     "최소원[서울_2반_A201]팀원",
  //     "최현규[서울_3반_A302]",
  //     "최지수[광주_1반_C107]팀장",
  //     "최주은[구미_1반_D103]팀원",
  //     "최다운[광주_1반_C106]팀장",
  //     "최대치[서울_5반_A506]팀원",
  //     "최승연[대전_1반_B105]팀장",
  //     "서울_15반_최희란",
  //     "구미_5반_최두나",
  //     "최하영[서울_1반_A102]팀원",
  //     "최종현[서울_6반_A603]팀원",
  //     "최범규[광주_1반_C108_팀원]",
  //     "최상후[부울경_오픈소스_S207]팀원",
  //     "서울_14반_최혜진",
  //     "최재진[서울_3반_ A302]팀원",
  //     "광주_1반_최영수",
  //     "최영빈[구미_1반_D103]팀원",
  //     "최우영(교육프로)",
  //     "최미정(교육프로)",
  //     "서울_11반_최정은",
  //     "최윤수[서울_2반_A205]팀원",
  //     "최윤석[광주_2반_C204]팀원",
  //     "최현정[구미_1반_D106]팀원",
  //     "최상진[서울_3반_A306]팀원",
  //     "최부성[서울_5반_A502]팀원",
  //     "최영운[서울_1반_A102]팀원",
  //     "최호근(담당교수)",
  //     "최지우[구미_2반_D201]팀원",
  //     "최혜린[서울_3반_A307]팀원",
  //     "최이삭[부울경_1반_E101] 팀원"
  //   ]
  // }

  const searchMap = data.map((item) => {
    return <div>
      <p>{item}</p>
    </div>
  });

  return (
    <div className="search-main-div">
      <p>{searchMap}</p>
    </div>
    
  )
}

export default SearchPage